// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.WriteLine("Введите любое пятизначное целое положительное число: ");
int num = Convert.ToInt32(Console.ReadLine());
if (num > 99999 || num < 10000)
{
Console.WriteLine("Введено не пятизначное число/либо не целое/ либо отрицательное");
}
else if (num /10000 == num %10 && (num /1000)%10 == (num/10) % 10)
{
Console.WriteLine("Да , число полиндром");
}
else
{
Console.WriteLine("Нет , число не полиндром");
}